# England Housing

### This dataset provides information about housing options available in UK

The fields available in the dataset are as follows:
1. Date
2. Area
3. Average price
4. Code
5. Houses sold
6. Number of crimes

This dataset was downloaded from Kaggle. The dataset is stored in a CSV file.

The data available ranges from year 1995 to 2019.

The data will be analyzed using Python's Pandas library.

## Importing data:

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
data = pd.read_csv("/Users/sandeepkhetarpal/PycharmProjects/EDA/data/London Housing Data.csv")

In [ ]:
data

## Exploring data:

In [ ]:
data.count()

In [ ]:
data.isnull()

In [ ]:
data.isnull().sum()

### Null values in a heat map:

In [ ]:
import seaborn as sb
import matplotlib.pyplot as mp

In [ ]:
sb.heatmap(data.isnull())

## Cleaning data:

### Replacing null values:

In [ ]:
data = data.fillna(value = 0)

In [ ]:
data.isnull().sum()

In [ ]:
data

### Removing whitespaces from strings:

In [ ]:
str_columns = list(data.columns)
str_columns.remove('average_price')
str_columns.remove('houses_sold')
str_columns.remove('no_of_crimes')
for column in str_columns:
    data[column] = data[column].str.strip()

### Modifying datatypes:

In [ ]:
data.dtypes

In [ ]:
data.average_price = pd.to_numeric(data.average_price , downcast = 'float')

In [ ]:
data.dtypes

In [ ]:
data.date = pd.to_datetime(data.date)

In [ ]:
data

In [ ]:
data.dtypes

### Adding a new column 'year' in the dataframe which must contain only year:

In [ ]:
data.head()

In [ ]:
data['year'] = data.date.dt.year

In [ ]:
data

### Adding a new column 'month' in the dataframe which must contain only month:

In [ ]:
data.head()

In [ ]:
data['month'] = data.date.dt.month

In [ ]:
data

### Moving 'month' and 'year' columns next to 'date' column:

In [ ]:
data.insert(1 , 'month' , data.pop('month'))

In [ ]:
data

In [ ]:
data.insert(2 , 'year' , data.pop('year'))

In [ ]:
data

### Removing 'month' column from the dataframe:

In [ ]:
data.drop('month' , axis = 1 , inplace = True)

In [ ]:
data.head()

## Analyzing data:

### 1. Display all records where number of crimes is 0 and how many such records are there?

In [ ]:
data[data.no_of_crimes == 0]

In [ ]:
len(data[data.no_of_crimes == 0])

### 2. What is the maximum and minimum average price of houses in London?

In [ ]:
df1 = data[data.area == 'city of london']

In [ ]:
df1

In [ ]:
df1.groupby('year').average_price.max()

In [ ]:
df1.groupby('year').average_price.min()

### 3. What is the maximum and minimum number of crimes recorded in each area?

In [ ]:
data.groupby('area').no_of_crimes.max()

In [ ]:
data.groupby('area').no_of_crimes.min()

### 4. Show the total count of records of each area where average price is less than 100000.

In [39]:
df1 = data[data.area == 'city of london']

In [40]:
df1

,date,year,area,average_price,code,houses_sold,no_of_crimes
0,1995-01-01,1995,city of london,91449.0,E09000001,17.0,0.0
1,1995-02-01,1995,city of london,82203.0,E09000001,7.0,0.0
2,1995-03-01,1995,city of london,79121.0,E09000001,14.0,0.0
3,1995-04-01,1995,city of london,77101.0,E09000001,7.0,0.0
4,1995-05-01,1995,city of london,84409.0,E09000001,10.0,0.0
...,...,...,...,...,...,...,...
296,2019-09-01,2019,city of london,792034.0,E09000001,11.0,0.0
297,2019-10-01,2019,city of london,827093.0,E09000001,4.0,0.0
298,2019-11-01,2019,city of london,777610.0,E09000001,5.0,0.0
299,2019-12-01,2019,city of london,734872.0,E09000001,0.0,0.0
300,2020-01-01,2020,city of london,775309.0,E09000001,0.0,0.0

In [41]:
df1.groupby('year').average_price.max()

year
1995    127232.0
1996    120543.0
1997    131074.0
1998    163403.0
1999    191157.0
2000    321773.0
2001    362204.0
2002    344239.0
2003    305556.0
2004    333075.0
2005    339626.0
2006    377545.0
2007    473887.0
2008    472397.0
2009    411955.0
2010    498241.0
2011    516319.0
2012    573532.0
2013    662700.0
2014    773768.0
2015    783667.0
2016    911827.0
2017    939912.0
2018    811694.0
2019    894680.0
2020    775309.0
Name: average_price, dtype: float32

In [42]:
df1.groupby('year').average_price.min()

year
1995     77101.0
1996     93357.0
1997    107488.0
1998    124382.0
1999    149143.0
2000    173738.0
2001    189033.0
2002    227281.0
2003    243184.0
2004    269514.0
2005    282866.0
2006    304977.0
2007    360923.0
2008    382571.0
2009    345338.0
2010    420234.0
2011    420435.0
2012    491529.0
2013    465451.0
2014    625001.0
2015    713253.0
2016    736788.0
2017    778002.0
2018    732351.0
2019    718773.0
2020    775309.0
Name: average_price, dtype: float32

### 3. What is the maximum and minimum number of crimes recorded in each area?

In [43]:
data.groupby('area').no_of_crimes.max()

area
barking and dagenham      2049.0
barnet                    2893.0
bexley                    1914.0
brent                     2937.0
bromley                   2637.0
camden                    4558.0
city of london              10.0
croydon                   3263.0
ealing                    3401.0
east midlands                0.0
east of england              0.0
enfield                   2798.0
england                      0.0
greenwich                 2853.0
hackney                   3466.0
hammersmith and fulham    2645.0
haringey                  3199.0
harrow                    1763.0
havering                  1956.0
hillingdon                2819.0
hounslow                  2817.0
inner london                 0.0
islington                 3384.0
kensington and chelsea    2778.0
kingston upon thames      1379.0
lambeth                   4701.0
lewisham                  2813.0
london                       0.0
merton                    1623.0
newham                    3668.0
north east                   0.0
north west                   0.0
outer london                 0.0
redbridge                 2560.0
richmond upon thames      1551.0
south east                   0.0
south west                   0.0
southwark                 3821.0
sutton                    1425.0
tower hamlets             3316.0
waltham forest            2941.0
wandsworth                3051.0
west midlands                0.0
westminster               7461.0
yorks and the humber         0.0
Name: no_of_crimes, dtype: float64

In [44]:
data.groupby('area').no_of_crimes.min()

area
barking and dagenham      0.0
barnet                    0.0
bexley                    0.0
brent                     0.0
bromley                   0.0
camden                    0.0
city of london            0.0
croydon                   0.0
ealing                    0.0
east midlands             0.0
east of england           0.0
enfield                   0.0
england                   0.0
greenwich                 0.0
hackney                   0.0
hammersmith and fulham    0.0
haringey                  0.0
harrow                    0.0
havering                  0.0
hillingdon                0.0
hounslow                  0.0
inner london              0.0
islington                 0.0
kensington and chelsea    0.0
kingston upon thames      0.0
lambeth                   0.0
lewisham                  0.0
london                    0.0
merton                    0.0
newham                    0.0
north east                0.0
north west                0.0
outer london              0.0
redbridge                 0.0
richmond upon thames      0.0
south east                0.0
south west                0.0
southwark                 0.0
sutton                    0.0
tower hamlets             0.0
waltham forest            0.0
wandsworth                0.0
west midlands             0.0
westminster               0.0
yorks and the humber      0.0
Name: no_of_crimes, dtype: float64

### 4. Show the total count of records of each area where average price is less than 100000.

In [45]:
df1 = data[data.area == 'city of london']

In [46]:
df1

,date,year,area,average_price,code,houses_sold,no_of_crimes
0,1995-01-01,1995,city of london,91449.0,E09000001,17.0,0.0
1,1995-02-01,1995,city of london,82203.0,E09000001,7.0,0.0
2,1995-03-01,1995,city of london,79121.0,E09000001,14.0,0.0
3,1995-04-01,1995,city of london,77101.0,E09000001,7.0,0.0
4,1995-05-01,1995,city of london,84409.0,E09000001,10.0,0.0
...,...,...,...,...,...,...,...
296,2019-09-01,2019,city of london,792034.0,E09000001,11.0,0.0
297,2019-10-01,2019,city of london,827093.0,E09000001,4.0,0.0
298,2019-11-01,2019,city of london,777610.0,E09000001,5.0,0.0
299,2019-12-01,2019,city of london,734872.0,E09000001,0.0,0.0
300,2020-01-01,2020,city of london,775309.0,E09000001,0.0,0.0

In [47]:
df1.groupby('year').average_price.max()

year
1995    127232.0
1996    120543.0
1997    131074.0
1998    163403.0
1999    191157.0
2000    321773.0
2001    362204.0
2002    344239.0
2003    305556.0
2004    333075.0
2005    339626.0
2006    377545.0
2007    473887.0
2008    472397.0
2009    411955.0
2010    498241.0
2011    516319.0
2012    573532.0
2013    662700.0
2014    773768.0
2015    783667.0
2016    911827.0
2017    939912.0
2018    811694.0
2019    894680.0
2020    775309.0
Name: average_price, dtype: float32

In [48]:
df1.groupby('year').average_price.min()

year
1995     77101.0
1996     93357.0
1997    107488.0
1998    124382.0
1999    149143.0
2000    173738.0
2001    189033.0
2002    227281.0
2003    243184.0
2004    269514.0
2005    282866.0
2006    304977.0
2007    360923.0
2008    382571.0
2009    345338.0
2010    420234.0
2011    420435.0
2012    491529.0
2013    465451.0
2014    625001.0
2015    713253.0
2016    736788.0
2017    778002.0
2018    732351.0
2019    718773.0
2020    775309.0
Name: average_price, dtype: float32

### 3. What is the maximum and minimum number of crimes recorded in each area?

In [49]:
data.groupby('area').no_of_crimes.max()

area
barking and dagenham      2049.0
barnet                    2893.0
bexley                    1914.0
brent                     2937.0
bromley                   2637.0
camden                    4558.0
city of london              10.0
croydon                   3263.0
ealing                    3401.0
east midlands                0.0
east of england              0.0
enfield                   2798.0
england                      0.0
greenwich                 2853.0
hackney                   3466.0
hammersmith and fulham    2645.0
haringey                  3199.0
harrow                    1763.0
havering                  1956.0
hillingdon                2819.0
hounslow                  2817.0
inner london                 0.0
islington                 3384.0
kensington and chelsea    2778.0
kingston upon thames      1379.0
lambeth                   4701.0
lewisham                  2813.0
london                       0.0
merton                    1623.0
newham                    3668.0
north east                   0.0
north west                   0.0
outer london                 0.0
redbridge                 2560.0
richmond upon thames      1551.0
south east                   0.0
south west                   0.0
southwark                 3821.0
sutton                    1425.0
tower hamlets             3316.0
waltham forest            2941.0
wandsworth                3051.0
west midlands                0.0
westminster               7461.0
yorks and the humber         0.0
Name: no_of_crimes, dtype: float64

In [50]:
data.groupby('area').no_of_crimes.min()

area
barking and dagenham      0.0
barnet                    0.0
bexley                    0.0
brent                     0.0
bromley                   0.0
camden                    0.0
city of london            0.0
croydon                   0.0
ealing                    0.0
east midlands             0.0
east of england           0.0
enfield                   0.0
england                   0.0
greenwich                 0.0
hackney                   0.0
hammersmith and fulham    0.0
haringey                  0.0
harrow                    0.0
havering                  0.0
hillingdon                0.0
hounslow                  0.0
inner london              0.0
islington                 0.0
kensington and chelsea    0.0
kingston upon thames      0.0
lambeth                   0.0
lewisham                  0.0
london                    0.0
merton                    0.0
newham                    0.0
north east                0.0
north west                0.0
outer london              0.0
redbridge                 0.0
richmond upon thames      0.0
south east                0.0
south west                0.0
southwark                 0.0
sutton                    0.0
tower hamlets             0.0
waltham forest            0.0
wandsworth                0.0
west midlands             0.0
westminster               0.0
yorks and the humber      0.0
Name: no_of_crimes, dtype: float64

### 4. Show the total count of records of each area where average price is less than 100000.

In [51]:
df2 = data[data.average_price < 100000]

In [52]:
df2

,date,year,area,average_price,code,houses_sold,no_of_crimes
0,1995-01-01,1995,city of london,91449.0,E09000001,17.0,0.0
1,1995-02-01,1995,city of london,82203.0,E09000001,7.0,0.0
2,1995-03-01,1995,city of london,79121.0,E09000001,14.0,0.0
3,1995-04-01,1995,city of london,77101.0,E09000001,7.0,0.0
4,1995-05-01,1995,city of london,84409.0,E09000001,10.0,0.0
...,...,...,...,...,...,...,...
13330,2001-11-01,2001,england,95083.0,E92000001,109149.0,0.0
13331,2001-12-01,2001,england,95992.0,E92000001,93329.0,0.0
13332,2002-01-01,2002,england,96215.0,E92000001,71678.0,0.0
13333,2002-02-01,2002,england,96676.0,E92000001,77131.0,0.0
13334,2002-03-01,2002,england,98962.0,E92000001,102828.0,0.0

In [53]:
df2.area.value_counts()

north east              112
north west              111
yorks and the humber    110
east midlands            96
west midlands            94
england                  87
barking and dagenham     85
south west               78
east of england          76
newham                   72
bexley                   64
waltham forest           64
lewisham                 62
havering                 60
south east               59
greenwich                59
croydon                  57
enfield                  54
sutton                   54
hackney                  53
redbridge                52
southwark                48
tower hamlets            47
outer london             46
hillingdon               44
lambeth                  41
hounslow                 41
brent                    40
london                   39
merton                   35
haringey                 33
bromley                  33
inner london             31
ealing                   31
kingston upon thames     30
harrow                   30
wandsworth               26
barnet                   25
islington                19
city of london           11
Name: area, dtype: int64